# Setup connection to postgres server

Assume that we are running the server in on a node called `postgres` See [https://github.com/IITDBGroup/cs480](https://github.com/IITDBGroup/cs480) to see how to setup a docker container and link the notebook container to expose the postgres server as `postgres` on the notebookserver. Make sure to run this cell first to get a connection. The syntax for running SQL code from a jupyter notebook using cell magic is described [here](https://jupysql.ploomber.io/en/latest/quick-start.html). **Every time you open this notebook, you have to execute the cell below to open a connection to postgres.**

In [3]:
%reload_ext sql    
%sql postgresql://postgres:cs480@notebpostgres/cs480

Connecting and switching to connection 'postgresql://postgres:***@notebpostgres/cs480'

# Basic SQL syntax, constants, and identifiers

## Keywords

Keywords in SQL are case insensitive, e.g., `SELECT`, `SeLeCT`, and `select` will all be recognized as the keyword "SELECT" in SQL. 

## Identifiers

The conventions for identifiers (e.g., table and attribute names) in SQL are dependent on the database system you are using. Typically, identifiers are case-insensitive, have to start with a letter, and can contain letters, numbers, and `_` (underscore). Postgres internally stores identifiers as lowercase, e.g., table names `STuDENt`, `student`, and `STUDENT` would all be represented internally as `student`. Using quoting, you can use identifiers that do not follow this syntax. Quoted identifiers are delimited by `"` (double quote). For example, `99people` is not a valid identifier since it starts with a number. However, `"99people"` is allowed. 

## Constants

* String constants in SQL are delimited by `'` (single quote), e.g., `'Peter'` is a valid string
* Number constants, e.g., `1`, `12432`, `-234235`
* Format of date constants is database system dependent. Most systems allow you to specify the format for a date. See [https://www.postgresql.org/docs/9.6/static/datatype-datetime.html](https://www.postgresql.org/docs/9.6/static/datatype-datetime.html) for information of how dates are handled in Postgres. For example, ` DATE '2004-10-19'` creates a date constant

## Casting

* In postgres casting is denoted by `expression::datatype`. For instance, `'123'::int` casts the string constant `'123'` as an integer

## Function Calls

* functions are called using `()`. For instance, function `upper` converts a string into upper case: `upper('abc')` would yield `'ABC'`.

Casting examples. Postgres applies some limited form of type inferences. Whenever you use a function where postgres does not have an implementation of this function for the given input data types, Postgres tries to cast one or both of the input such that an existing implementation can be applied. For instance, Postgres does not have a function to multiply a `float` with and `int`. However, the following query still works, because postgres will cast the int (`1`) into a float and can then apply the function `*(float,float)`. See [https://www.postgresql.org/docs/9.6/static/typeconv.html](https://www.postgresql.org/docs/9.6/static/typeconv.html) for details.

In [4]:
%%sql
SELECT (1.3 * 1)::int

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

1 rows affected.

+------+
| int4 |
+------+
|  1   |
+------+

same here, Postgres does not have a function to compare a `text` with an `int`. This works, because the `int` will be cast into a string, i.e., the resulting expression is `'1' = 1::text`

In [5]:
%%sql
SELECT '1' = 1;

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

1 rows affected.

+----------+
| ?column? |
+----------+
|   True   |
+----------+

# Data Definition Language (DDL)

The data definition language part of SQL allows you to change the schema of a database, e.g., creating new relations (tables) or changing the schema of a relation.

## Creating Tables

The create table statement creates a new table. It is of the form:

~~~sql
CREATE TABLE table_name (attrdefs_and_constraints);

attrdefs_and_constraints := (attrdef | constraint)*

attrdef := name datatype
constraint := PRIMARY KEY (attrname_list) | FOREIGN KEY (attrname_list) REFERENCES relation_name | ...
~~~

Let's create a table to store information about student organizations which records for each organization their `name`, `budget`, and whether its membership is restricted to persons of a particular gender (`m = male`, `f = female`, `a = all`).

In [6]:
%%sql
CREATE TABLE student_org 
(
    name TEXT,
    budget float,
    gender char(1),
    PRIMARY KEY (name)
);

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

++
||
++
++

Now let's check out the newly generated table using a query: `SELECT * FROM table_name` returns all rows of table `table_name`. We will discuss queries in more detail later.

In [7]:
%%sql
SELECT * FROM student_org;

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

+------+--------+--------+
| name | budget | gender |
+------+--------+--------+
+------+--------+--------+

Now let's insert some rows into our new table. We are using SQL's insert command of the form

~~~sql
INSERT INTO table_name VALUES (value_list);
~~~

and then check the updated content.

In [8]:
%%sql
INSERT INTO student_org VALUES ('ACM', 10000, 'a');
INSERT INTO student_org VALUES ('IEEE', 20000, 'a');
SELECT * FROM student_org;

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

1 rows affected.

1 rows affected.

2 rows affected.

+------+---------+--------+
| name |  budget | gender |
+------+---------+--------+
| ACM  | 10000.0 |   a    |
| IEEE | 20000.0 |   a    |
+------+---------+--------+

## Changing the schema of a relation

SQL provides the `ALTER TABLE` command for changing the schema of a relation. Let's add a column storing the immigration status of student to the `student` relation:

In [9]:
%%sql
ALTER TABLE student ADD imm_status VARCHAR(30);

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

++
||
++
++

Again, let's see how this affected the student relation using a query. A shown below, the database has set the value of the new column to `NULL` (shown as `None` in Python) for all students in the database.

In [10]:
%%sql
SELECT * FROM student;

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

13 rows affected.

+-------+----------+------------+----------+------------+
|   id  |   name   | dept_name  | tot_cred | imm_status |
+-------+----------+------------+----------+------------+
| 00128 |  Zhang   | Comp. Sci. |   102    |    None    |
| 12345 | Shankar  | Comp. Sci. |    32    |    None    |
| 19991 |  Brandt  |  History   |    80    |    None    |
| 23121 |  Chavez  |  Finance   |   110    |    None    |
| 44553 | Peltier  |  Physics   |    56    |    None    |
| 45678 |   Levy   |  Physics   |    46    |    None    |
| 54321 | Williams | Comp. Sci. |    54    |    None    |
| 55739 | Sanchez  |   Music    |    38    |    None    |
| 70557 |   Snow   |  Physics   |    0     |    None    |
| 76543 |  Brown   | Comp. Sci. |    58    |    None    |
+-------+----------+------------+----------+------------+
Truncated to displaylimit of 10.

Now let's get rid of this column.

In [11]:
%%sql
ALTER TABLE student DROP imm_status;

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

++
||
++
++

... and check that we are back to normal.

In [12]:
%%sql
SELECT * FROM student;

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

13 rows affected.

+-------+----------+------------+----------+
|   id  |   name   | dept_name  | tot_cred |
+-------+----------+------------+----------+
| 00128 |  Zhang   | Comp. Sci. |   102    |
| 12345 | Shankar  | Comp. Sci. |    32    |
| 19991 |  Brandt  |  History   |    80    |
| 23121 |  Chavez  |  Finance   |   110    |
| 44553 | Peltier  |  Physics   |    56    |
| 45678 |   Levy   |  Physics   |    46    |
| 54321 | Williams | Comp. Sci. |    54    |
| 55739 | Sanchez  |   Music    |    38    |
| 70557 |   Snow   |  Physics   |    0     |
| 76543 |  Brown   | Comp. Sci. |    58    |
+-------+----------+------------+----------+
Truncated to displaylimit of 10.

# Run basic SQL queries

First let's run some basic queries over the **University** schema from the textbook

Get all departments (here the * * * is a shortcut referring to all attributes)

In [13]:
%%sql
SELECT * FROM department

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

7 rows affected.

+------------+----------+-----------+
| dept_name  | building |   budget  |
+------------+----------+-----------+
|  Biology   |  Watson  |  90000.00 |
| Comp. Sci. |  Taylor  | 100000.00 |
| Elec. Eng. |  Taylor  |  85000.00 |
|  Finance   | Painter  | 120000.00 |
|  History   | Painter  |  50000.00 |
|   Music    | Packard  |  80000.00 |
|  Physics   |  Watson  |  70000.00 |
+------------+----------+-----------+

Only show the names of departments:

In [14]:
%%sql
SELECT dept_name FROM department

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

7 rows affected.

+------------+
| dept_name  |
+------------+
|  Biology   |
| Comp. Sci. |
| Elec. Eng. |
|  Finance   |
|  History   |
|   Music    |
|  Physics   |
+------------+

Find all departments that at least one student is associated with. Do only return each department one (using `DISTINCT`)

In [15]:
%%sql
SELECT DISTINCT dept_name FROM student

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

7 rows affected.

+------------+
| dept_name  |
+------------+
|  Finance   |
|  History   |
|  Physics   |
|   Music    |
| Comp. Sci. |
|  Biology   |
| Elec. Eng. |
+------------+

just to demonstrate what would be different if we omit the `DISTINCT`

In [16]:
%%sql 
SELECT dept_name FROM student

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

13 rows affected.

+------------+
| dept_name  |
+------------+
| Comp. Sci. |
| Comp. Sci. |
|  History   |
|  Finance   |
|  Physics   |
|  Physics   |
| Comp. Sci. |
|   Music    |
|  Physics   |
| Comp. Sci. |
+------------+
Truncated to displaylimit of 10.

Return ids of students that have more than 50 total credits

In [17]:
%%sql
SELECT id 
FROM student
WHERE tot_cred > 50

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

9 rows affected.

+-------+
|   id  |
+-------+
| 00128 |
| 19991 |
| 23121 |
| 44553 |
| 54321 |
| 76543 |
| 76653 |
| 98765 |
| 98988 |
+-------+

just to confirm that this worked let's get back all of the attributes

In [18]:
%%sql
SELECT *
FROM student
WHERE tot_cred > 50

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

9 rows affected.

+-------+----------+------------+----------+
|   id  |   name   | dept_name  | tot_cred |
+-------+----------+------------+----------+
| 00128 |  Zhang   | Comp. Sci. |   102    |
| 19991 |  Brandt  |  History   |    80    |
| 23121 |  Chavez  |  Finance   |   110    |
| 44553 | Peltier  |  Physics   |    56    |
| 54321 | Williams | Comp. Sci. |    54    |
| 76543 |  Brown   | Comp. Sci. |    58    |
| 76653 |   Aoi    | Elec. Eng. |    60    |
| 98765 | Bourikas | Elec. Eng. |    98    |
| 98988 |  Tanaka  |  Biology   |   120    |
+-------+----------+------------+----------+

Finding all the instructors and the buildings they are working in

In [19]:
%%sql
SELECT name, building
FROM instructor, department
WHERE instructor.dept_name = department.dept_name

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

12 rows affected.

+------------+----------+
|    name    | building |
+------------+----------+
| Srinivasan |  Taylor  |
|     Wu     | Painter  |
|   Mozart   | Packard  |
|  Einstein  |  Watson  |
|  El Said   | Painter  |
|    Gold    |  Watson  |
|    Katz    |  Taylor  |
| Califieri  | Painter  |
|   Singh    | Painter  |
|   Crick    |  Watson  |
+------------+----------+
Truncated to displaylimit of 10.

or using aliasing we can write the same query with less code. In SQL you can assign an alias to a relation in the `FROM` clause like this `relation alias`. Then you can refer to the relation using the alias instead of the relation name in the `SELECT` and `WHERE` clauses.

In [20]:
%%sql
SELECT i.name, d.building
FROM instructor i, department d
WHERE i.dept_name = d.dept_name

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

12 rows affected.

+------------+----------+
|    name    | building |
+------------+----------+
| Srinivasan |  Taylor  |
|     Wu     | Painter  |
|   Mozart   | Packard  |
|  Einstein  |  Watson  |
|  El Said   | Painter  |
|    Gold    |  Watson  |
|    Katz    |  Taylor  |
| Califieri  | Painter  |
|   Singh    | Painter  |
|   Crick    |  Watson  |
+------------+----------+
Truncated to displaylimit of 10.

Pairs of instructors working for the same department (we use `x.name <> y.name` to ensure that we are not pairing an instructment with him-/herself.

In [21]:
%%sql
SELECT x.name, y.name
FROM instructor x, instructor y
WHERE x.dept_name = y.dept_name AND x.name <> y.name

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

12 rows affected.

+------------+------------+
|    name    |   name_1   |
+------------+------------+
| Srinivasan |   Brandt   |
| Srinivasan |    Katz    |
|     Wu     |   Singh    |
|  Einstein  |    Gold    |
|  El Said   | Califieri  |
|    Gold    |  Einstein  |
|    Katz    |   Brandt   |
|    Katz    | Srinivasan |
| Califieri  |  El Said   |
|   Singh    |     Wu     |
+------------+------------+
Truncated to displaylimit of 10.

However this still returns each pair of instructors A and B twice. Once as `(A,B)` and once as `(B,A)`. To avoid that we can enforce that the name of the left instructor is lexicographically smaller than the name of the right instructor by adding a condition `x.name < y.name`.

In [22]:
%%sql
SELECT x.name, y.name AS name_right
FROM instructor x, instructor y
WHERE x.dept_name = y.dept_name AND x.name <> y.name AND x.name < y.name

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

6 rows affected.

+-----------+------------+
|    name   | name_right |
+-----------+------------+
|  Einstein |    Gold    |
|    Katz   | Srinivasan |
| Califieri |  El Said   |
|   Singh   |     Wu     |
|   Brandt  |    Katz    |
|   Brandt  | Srinivasan |
+-----------+------------+

In the `SELECT` clause you can also use expressions, e.g., arithmetics and renaming (`expression AS new_name`).

In [23]:
%%sql
SELECT name, tot_cred / 10 AS one_tenth_cred
FROM student

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

13 rows affected.

+----------+---------------------+
|   name   |    one_tenth_cred   |
+----------+---------------------+
|  Zhang   | 10.2000000000000000 |
| Shankar  |  3.2000000000000000 |
|  Brandt  |  8.0000000000000000 |
|  Chavez  | 11.0000000000000000 |
| Peltier  |  5.6000000000000000 |
|   Levy   |  4.6000000000000000 |
| Williams |  5.4000000000000000 |
| Sanchez  |  3.8000000000000000 |
|   Snow   |        0E-20        |
|  Brown   |  5.8000000000000000 |
+----------+---------------------+
Truncated to displaylimit of 10.

new operators for comparison and case distinctions, return for each student an indicator whether they are ready to graduate. A student is ready to graduate if they have earned more than 80 credits.

In [24]:
%%sql
SELECT name, tot_cred, CASE WHEN tot_cred > 80 THEN 'ready to graduate' ELSE 'not ready' END AS grad_status
FROM student

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

13 rows affected.

+----------+----------+-------------------+
|   name   | tot_cred |    grad_status    |
+----------+----------+-------------------+
|  Zhang   |   102    | ready to graduate |
| Shankar  |    32    |     not ready     |
|  Brandt  |    80    |     not ready     |
|  Chavez  |   110    | ready to graduate |
| Peltier  |    56    |     not ready     |
|   Levy   |    46    |     not ready     |
| Williams |    54    |     not ready     |
| Sanchez  |    38    |     not ready     |
|   Snow   |    0     |     not ready     |
|  Brown   |    58    |     not ready     |
+----------+----------+-------------------+
Truncated to displaylimit of 10.

return students with between 80 and 100 credits

In [25]:
%%sql
SELECT name, tot_cred
FROM student
WHERE tot_cred BETWEEN 80 AND 100

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

2 rows affected.

+----------+----------+
|   name   | tot_cred |
+----------+----------+
|  Brandt  |    80    |
| Bourikas |    98    |
+----------+----------+

Based on student request, we made it work using aggregation and having (assuming that student names are unique)

In [26]:
%%sql
SELECT name, min(tot_cred) AS tot_cred
FROM student
GROUP BY name
HAVING min(tot_cred) >= 80 AND max(tot_cred) <= 100

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

2 rows affected.

+----------+----------+
|   name   | tot_cred |
+----------+----------+
| Bourikas |    98    |
|  Brandt  |    80    |
+----------+----------+

Return the average total credits of students per department. In SQL, aggregation is applied in the `SELECT` clause. Group-by expressions are given a separate `GROUP BY` clause.

In [27]:
%%sql
SELECT dept_name, avg(tot_cred) AS avg_cred
FROM student
GROUP BY dept_name

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

7 rows affected.

+------------+----------------------+
| dept_name  |       avg_cred       |
+------------+----------------------+
|  Finance   | 110.0000000000000000 |
|  History   | 80.0000000000000000  |
|  Physics   | 34.0000000000000000  |
|   Music    | 38.0000000000000000  |
| Comp. Sci. | 61.5000000000000000  |
|  Biology   | 120.0000000000000000 |
| Elec. Eng. | 79.0000000000000000  |
+------------+----------------------+

If we only want departments where the average credit is larger than `100` we can apply a `HAVING` clause to post-filter the result after aggregation. The `HAVING` clause and the `WHERE` clause both correspond to selection in relational algebra. The difference is that the `WHERE` clause is applied **before** any aggregation or grouping is evaluated and the `HAVING` clause is applied **after** aggregation. Note that the `HAVING` clause may reference aggregation functions that are not used in the `SELECT` clause.

In [28]:
%%sql
SELECT dept_name, avg(tot_cred) AS avg_cred
FROM student
GROUP BY dept_name
HAVING avg(tot_cred) > 100

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

2 rows affected.

+-----------+----------------------+
| dept_name |       avg_cred       |
+-----------+----------------------+
|  Finance  | 110.0000000000000000 |
|  Biology  | 120.0000000000000000 |
+-----------+----------------------+

Return the total credit hours students from the `Music` or `Biology` departments have taken.

In [29]:
%%sql
SELECT sum(tot_cred)
FROM student
WHERE dept_name = 'Music' OR dept_name = 'Biology'

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

1 rows affected.

+-----+
| sum |
+-----+
| 158 |
+-----+

Return the highest instructor salary:

In [30]:
%%sql
SELECT max(salary)
FROM instructor

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

1 rows affected.

+----------+
|   max    |
+----------+
| 95000.00 |
+----------+

Same query, but using the trick we introduced in the relational algebra part of the lecture to compute maximal salaries without using aggregation (find salaries for which at least one higher salary exists and then remove these salaries from the set of all salaries). Note that here we are using the **Set** version of set difference.

In [31]:
%%sql
(SELECT salary FROM instructor)
EXCEPT
(SELECT l.salary
FROM instructor l, instructor r
WHERE l.salary < r.salary)

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

1 rows affected.

+----------+
|  salary  |
+----------+
| 95000.00 |
+----------+

Now let's get back the names of instructors with the highest salaries. This requires joining the result of aggregation with the instructor table. Here we use two new features:

* `WITH q AS (SELECT ...)` defines a so-called common table expression (CTE). This works just like assignment in relational algebra
* the `FROM` clause can contain queries. The semantics is that the queries in the `FROM` clause are evaluated first before we evaluate the outer query.

In [32]:
%%sql
WITH maxSal AS (SELECT max(salary) AS msal
FROM instructor)
SELECT i.name
FROM maxSal m, instructor i
WHERE msal = i.salary

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

1 rows affected.

+----------+
|   name   |
+----------+
| Einstein |
+----------+

Or using subqueries in the `FROM` clause instead of the CTEs

In [33]:
%%sql
SELECT i.name
FROM (SELECT max(salary) AS msal
      FROM instructor) m, 
      instructor i
WHERE msal = i.salary

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

1 rows affected.

+----------+
|   name   |
+----------+
| Einstein |
+----------+

Find names of students with the lowest tot_credit. Here we are using a nested subquery to compute the lowest `tot_cred` value.

In [34]:
%%sql
SELECT s.name, s.tot_cred
FROM student s
WHERE s.tot_cred = (SELECT min(t.tot_cred) FROM student t)

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

1 rows affected.

+------+----------+
| name | tot_cred |
+------+----------+
| Snow |    0     |
+------+----------+

with `ORDER BY` and `LIMIT`. Limit returns a specified number of rows and is evaluated after the `ORDER BY`. Thus, in this case it returns the student (or one of the students) with the lowest `tot_cred`

In [35]:
%%sql
SELECT s.name, tot_cred
FROM student s
ORDER BY tot_cred ASC
LIMIT 1

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

1 rows affected.

+------+----------+
| name | tot_cred |
+------+----------+
| Snow |    0     |
+------+----------+

Return the instructors that have not thaught any Biology classes. We use a CTE to compute the ids of instructors that have thaught Biology courses and then use a nested subquery `NOT IN` to only return instructors that are not in that set.

In [36]:
%%sql
WITH bioids AS (
SELECT t.id
FROM course c, teaches t
WHERE c.dept_name = 'Biology' AND c.course_id = t.course_id)

SELECT i.*
FROM instructor i
WHERE i.id NOT IN (SELECT * FROM bioids)

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

11 rows affected.

+-------+------------+------------+----------+
|   id  |    name    | dept_name  |  salary  |
+-------+------------+------------+----------+
| 10101 | Srinivasan | Comp. Sci. | 65000.00 |
| 12121 |     Wu     |  Finance   | 90000.00 |
| 15151 |   Mozart   |   Music    | 40000.00 |
| 22222 |  Einstein  |  Physics   | 95000.00 |
| 32343 |  El Said   |  History   | 60000.00 |
| 33456 |    Gold    |  Physics   | 87000.00 |
| 45565 |    Katz    | Comp. Sci. | 75000.00 |
| 58583 | Califieri  |  History   | 62000.00 |
| 76543 |   Singh    |  Finance   | 80000.00 |
| 83821 |   Brandt   | Comp. Sci. | 92000.00 |
+-------+------------+------------+----------+
Truncated to displaylimit of 10.

## Like construct

Here are some more examples using `LIKE`. Like matches a string value against a pattern which can contain two special characters: `%` matches any sequence of characters (including the empty string) and `_` matches exactly one character (any characters works).

get students whose name starts with `A`

In [37]:
%%sql
SELECT * 
FROM student
WHERE name LIKE 'A%';

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

1 rows affected.

+-------+------+------------+----------+
|   id  | name | dept_name  | tot_cred |
+-------+------+------------+----------+
| 76653 | Aoi  | Elec. Eng. |    60    |
+-------+------+------------+----------+

Get students whose name contains the string `ow`.

In [38]:
%%sql
SELECT *
FROM student
WHERE name LIKE '%ow%'

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

2 rows affected.

+-------+-------+------------+----------+
|   id  |  name | dept_name  | tot_cred |
+-------+-------+------------+----------+
| 70557 |  Snow |  Physics   |    0     |
| 76543 | Brown | Comp. Sci. |    58    |
+-------+-------+------------+----------+

Get students whose name is six characters long

In [39]:
%%sql
SELECT * FROM student
WHERE name LIKE '______'

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

3 rows affected.

+-------+--------+-----------+----------+
|   id  |  name  | dept_name | tot_cred |
+-------+--------+-----------+----------+
| 19991 | Brandt |  History  |    80    |
| 23121 | Chavez |  Finance  |   110    |
| 98988 | Tanaka |  Biology  |   120    |
+-------+--------+-----------+----------+

## Recursive Queries

Let's compute direct and indirect prerequisites

In [40]:
%%sql
SELECT * FROM prereq;

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

7 rows affected.

+-----------+-----------+
| course_id | prereq_id |
+-----------+-----------+
|  BIO-301  |  BIO-101  |
|  BIO-399  |  BIO-101  |
|   CS-190  |   CS-101  |
|   CS-315  |   CS-101  |
|   CS-319  |   CS-101  |
|   CS-347  |   CS-101  |
|   EE-181  |  PHY-101  |
+-----------+-----------+

Since there are no indirect prerequisties, let's insert ones

In [41]:
%%sql
INSERT INTO prereq VALUES ('CS-319', 'CS-315');
INSERT INTO prereq VALUES ('CS-347', 'CS-319');
INSERT INTO prereq VALUES ('EE-181', 'CS-347');

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

1 rows affected.

1 rows affected.

1 rows affected.

++
||
++
++

This results in the following prereq table, e.g,. one indirect prerequisite of `CS-319` is `CS-101` through a chain of prerequisites `CS-319 -> CS-315 -> CS-101`

In [42]:
%%sql
SELECT * FROM prereq;

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

10 rows affected.

+-----------+-----------+
| course_id | prereq_id |
+-----------+-----------+
|  BIO-301  |  BIO-101  |
|  BIO-399  |  BIO-101  |
|   CS-190  |   CS-101  |
|   CS-315  |   CS-101  |
|   CS-319  |   CS-101  |
|   CS-347  |   CS-101  |
|   EE-181  |  PHY-101  |
|   CS-319  |   CS-315  |
|   CS-347  |   CS-319  |
|   EE-181  |   CS-347  |
+-----------+-----------+
Truncated to displaylimit of 10.

Let's write the a query that returns prerequisites, and indirect prerequisites (path up to length 3)

In [43]:
%%sql
WITH p1 AS (SELECT * FROM prereq),
p2 AS (SELECT p1.course_id, two.prereq_id
       FROM p1, prereq two
       WHERE p1.prereq_id = two.course_id),
p3 AS (SELECT p2.course_id, two.prereq_id
       FROM p2, prereq two
       WHERE p2.prereq_id = two.course_id)
SELECT * FROM p1
UNION
SELECT * FROM p2
UNION
SELECT * FROM p3

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

14 rows affected.

+-----------+-----------+
| course_id | prereq_id |
+-----------+-----------+
|   EE-181  |   CS-315  |
|   CS-190  |   CS-101  |
|  BIO-399  |  BIO-101  |
|   CS-315  |   CS-101  |
|  BIO-301  |  BIO-101  |
|   EE-181  |   CS-347  |
|   EE-181  |  PHY-101  |
|   CS-347  |   CS-315  |
|   EE-181  |   CS-319  |
|   CS-347  |   CS-101  |
+-----------+-----------+
Truncated to displaylimit of 10.

Alternatively, to get all indirect prerequisities no matter how long the paths, we can use a recursive query. Every recusive step increases the length of considered paths by 1.

In [44]:
%%sql
WITH RECURSIVE inpre AS (
SELECT * FROM prereq -- init query
UNION
SELECT inpre.course_id, two.prereq_id -- recursive_step
FROM inpre, prereq two
WHERE inpre.prereq_id = two.course_id
)
SELECT * FROM inpre;

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

14 rows affected.

+-----------+-----------+
| course_id | prereq_id |
+-----------+-----------+
|  BIO-301  |  BIO-101  |
|  BIO-399  |  BIO-101  |
|   CS-190  |   CS-101  |
|   CS-315  |   CS-101  |
|   CS-319  |   CS-101  |
|   CS-347  |   CS-101  |
|   EE-181  |  PHY-101  |
|   CS-319  |   CS-315  |
|   CS-347  |   CS-319  |
|   EE-181  |   CS-347  |
+-----------+-----------+
Truncated to displaylimit of 10.

To expose the structure of the computation, we can add a column that counts iterations (corresponding to path length).

In [45]:
%%sql
WITH RECURSIVE inpre AS (
SELECT *, 1 path_length FROM prereq
UNION
SELECT inpre.course_id, two.prereq_id, path_length + 1 AS path_length
FROM inpre, prereq two
WHERE inpre.prereq_id = two.course_id
)
SELECT * FROM inpre;

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

19 rows affected.

+-----------+-----------+-------------+
| course_id | prereq_id | path_length |
+-----------+-----------+-------------+
|  BIO-301  |  BIO-101  |      1      |
|  BIO-399  |  BIO-101  |      1      |
|   CS-190  |   CS-101  |      1      |
|   CS-315  |   CS-101  |      1      |
|   CS-319  |   CS-101  |      1      |
|   CS-347  |   CS-101  |      1      |
|   EE-181  |  PHY-101  |      1      |
|   CS-319  |   CS-315  |      1      |
|   CS-347  |   CS-319  |      1      |
|   EE-181  |   CS-347  |      1      |
+-----------+-----------+-------------+
Truncated to displaylimit of 10.

Such a counter can then also be used to limit the depth of the recusion (number of recursive steps). For instance, to only compute paths of length up to 2:

In [46]:
%%sql
WITH RECURSIVE inpre AS (
SELECT *, 1 path_length FROM prereq
UNION
SELECT inpre.course_id, two.prereq_id, path_length + 1 AS path_length
FROM inpre, prereq two
WHERE inpre.prereq_id = two.course_id AND path_length < 2
)
SELECT * FROM inpre;

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

15 rows affected.

+-----------+-----------+-------------+
| course_id | prereq_id | path_length |
+-----------+-----------+-------------+
|  BIO-301  |  BIO-101  |      1      |
|  BIO-399  |  BIO-101  |      1      |
|   CS-190  |   CS-101  |      1      |
|   CS-315  |   CS-101  |      1      |
|   CS-319  |   CS-101  |      1      |
|   CS-347  |   CS-101  |      1      |
|   EE-181  |  PHY-101  |      1      |
|   CS-319  |   CS-315  |      1      |
|   CS-347  |   CS-319  |      1      |
|   EE-181  |   CS-347  |      1      |
+-----------+-----------+-------------+
Truncated to displaylimit of 10.

Sometimes, we would not just get the information which nodes are connected by paths, but also actually see these paths. The problem that we are facing is that paths may be of arbitrary length. Thus, we cannot represent each position in a path as a separate attribute, because then the query would not have a fixed schema. One way to circumvent this problem is to create a string to represent the whole path and store this string in one attribute. Then we can use string concatenation to extend a path:

In [47]:
%%sql
WITH RECURSIVE inpre AS (
SELECT *, 1 path_length, course_id || ' -> ' || prereq_id AS p FROM prereq
UNION
SELECT inpre.course_id, two.prereq_id, path_length + 1 AS path_length, p || '->' || two.prereq_id AS p
FROM inpre, prereq two
WHERE inpre.prereq_id = two.course_id
)
SELECT * FROM inpre;

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

19 rows affected.

+-----------+-----------+-------------+--------------------+
| course_id | prereq_id | path_length |         p          |
+-----------+-----------+-------------+--------------------+
|  BIO-301  |  BIO-101  |      1      | BIO-301 -> BIO-101 |
|  BIO-399  |  BIO-101  |      1      | BIO-399 -> BIO-101 |
|   CS-190  |   CS-101  |      1      |  CS-190 -> CS-101  |
|   CS-315  |   CS-101  |      1      |  CS-315 -> CS-101  |
|   CS-319  |   CS-101  |      1      |  CS-319 -> CS-101  |
|   CS-347  |   CS-101  |      1      |  CS-347 -> CS-101  |
|   EE-181  |  PHY-101  |      1      | EE-181 -> PHY-101  |
|   CS-319  |   CS-315  |      1      |  CS-319 -> CS-315  |
|   CS-347  |   CS-319  |      1      |  CS-347 -> CS-319  |
|   EE-181  |   CS-347  |      1      |  EE-181 -> CS-347  |
+-----------+-----------+-------------+--------------------+
Truncated to displaylimit of 10.

Alternatively, we can use the array datatype ([https://www.postgresql.org/docs/9.6/static/arrays.html](https://www.postgresql.org/docs/9.6/static/arrays.html)) in Postgres to create a more useful result.

In [48]:
%%sql
WITH RECURSIVE inpre AS (
SELECT *, 1 path_length, ARRAY[course_id,prereq_id]::text[] AS p FROM prereq
UNION
SELECT inpre.course_id, two.prereq_id, path_length + 1 AS path_length, p || ARRAY[two.prereq_id]::text[] AS p
FROM inpre, prereq two
WHERE inpre.prereq_id = two.course_id
)
SELECT * FROM inpre;

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

19 rows affected.

+-----------+-----------+-------------+------------------------+
| course_id | prereq_id | path_length |           p            |
+-----------+-----------+-------------+------------------------+
|  BIO-301  |  BIO-101  |      1      | ['BIO-301', 'BIO-101'] |
|  BIO-399  |  BIO-101  |      1      | ['BIO-399', 'BIO-101'] |
|   CS-190  |   CS-101  |      1      |  ['CS-190', 'CS-101']  |
|   CS-315  |   CS-101  |      1      |  ['CS-315', 'CS-101']  |
|   CS-319  |   CS-101  |      1      |  ['CS-319', 'CS-101']  |
|   CS-347  |   CS-101  |      1      |  ['CS-347', 'CS-101']  |
|   EE-181  |  PHY-101  |      1      | ['EE-181', 'PHY-101']  |
|   CS-319  |   CS-315  |      1      |  ['CS-319', 'CS-315']  |
|   CS-347  |   CS-319  |      1      |  ['CS-347', 'CS-319']  |
|   EE-181  |   CS-347  |      1      |  ['EE-181', 'CS-347']  |
+-----------+-----------+-------------+------------------------+
Truncated to displaylimit of 10.

Using arrays is better to access elements from the path, e.g., to get the third element of very path:

In [49]:
%%sql
WITH RECURSIVE inpre AS (
SELECT *, 1 path_length, ARRAY[course_id,prereq_id]::text[] AS p FROM prereq
UNION
SELECT inpre.course_id, two.prereq_id, path_length + 1 AS path_length, p || ARRAY[two.prereq_id]::text[] AS p
FROM inpre, prereq two
WHERE inpre.prereq_id = two.course_id
)
SELECT p, p[3] FROM inpre;

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

19 rows affected.

+------------------------+------+
|           p            | p_1  |
+------------------------+------+
| ['BIO-301', 'BIO-101'] | None |
| ['BIO-399', 'BIO-101'] | None |
|  ['CS-190', 'CS-101']  | None |
|  ['CS-315', 'CS-101']  | None |
|  ['CS-319', 'CS-101']  | None |
|  ['CS-347', 'CS-101']  | None |
| ['EE-181', 'PHY-101']  | None |
|  ['CS-319', 'CS-315']  | None |
|  ['CS-347', 'CS-319']  | None |
|  ['EE-181', 'CS-347']  | None |
+------------------------+------+
Truncated to displaylimit of 10.

If we just want to now how many paths exist that connects a pair of nodes, then we can use aggregation in the final query:

In [50]:
%%sql
WITH RECURSIVE inpre AS (
SELECT *, 1 path_length, course_id || ' -> ' || prereq_id AS p FROM prereq
UNION
SELECT inpre.course_id, two.prereq_id, path_length + 1 AS path_length, p || '->' || two.prereq_id AS p
FROM inpre, prereq two
WHERE inpre.prereq_id = two.course_id
)
SELECT course_id, prereq_id, count(*) AS numPath 
FROM inpre
GROUP BY course_id, prereq_id

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

14 rows affected.

+-----------+-----------+---------+
| course_id | prereq_id | numpath |
+-----------+-----------+---------+
|  BIO-301  |  BIO-101  |    1    |
|  BIO-399  |  BIO-101  |    1    |
|   CS-190  |   CS-101  |    1    |
|   CS-315  |   CS-101  |    1    |
|   CS-319  |   CS-101  |    2    |
|   CS-319  |   CS-315  |    1    |
|   CS-347  |   CS-101  |    3    |
|   CS-347  |   CS-315  |    1    |
|   CS-347  |   CS-319  |    1    |
|   EE-181  |   CS-101  |    3    |
+-----------+-----------+---------+
Truncated to displaylimit of 10.

** DO NOT EXECUTE THE FOLLOWING QUERY, IT WILL RECURSE ENDLESSLY **

In [51]:
%%sql
WITH RECURSIVE will_fail AS (
   SELECT 1 AS x
   UNION
   SELECT x + 1 AS x FROM will_fail
)
SELECT * FROM will_fail;

Running query in 'postgresql://postgres:***@notebpostgres/cs480'

/opt/conda/lib/python3.11/site-packages/sql/connection/connection.py:886: JupySQLRollbackPerformed: Server closed connection. JupySQL executed a ROLLBACK operation.
  warnings.warn(
RuntimeError: (psycopg2.OperationalError) server closed the connection unexpectedly
	This probably means the server terminated abnormally
	before or while processing the request.

[SQL: WITH RECURSIVE will_fail AS (
   SELECT 1 AS x
   UNION
   SELECT x + 1 AS x FROM will_fail
)
SELECT * FROM will_fail;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)
If you need help solving this issue, send us a message: https://ploomber.io/community

## Difference between WHERE and HAVING

The `WHERE` clause is applied after the `FROM` clause and before `SELECT`, `GROUP BY`. The `HAVING` clause is applied after the `GROUP BY` and computing aggregation functions (but before the `SELECT`).

For instance, we want to compute the average `tot_cred` for studends per department, but only want to consider students with more than `10` credits in the calculation and only want to return this information for departments with more than `3` such students (`count(*) > 3`). 

* the condition on `tot_cred` has to be evaluated before the aggregation, so it has to be part of the `WHERE` clause
* the condition `count(*) > 3` is refering to aggregation function results and, thus, has to be placed in the `HAVING` clause

In [ ]:
%%sql
SELECT avg(tot_cred), dept_name
FROM student
WHERE tot_cred > 10 -- NOT ALLOWED count(*) > 10
GROUP BY dept_name

HAVING count(*) > 3 -- NOT ALLOWED tot_cred > 10

To further illustrate that: The `HAVING` clause is equivalent to using a `WHERE` clause in an outer query and compute the aggregation in a subquery.

In [ ]:
%%sql
SELECT *
FROM (
SELECT avg(tot_cred) AS ac, count(*) AS c, dept_name
FROM student
WHERE tot_cred > 10
GROUP BY dept_name
) sub
WHERE c > 3

Note that a having clause may be present even though there are no aggregation functions in the `SELECT` clause. For example:

In [ ]:
%%sql
SELECT DISTINCT 'there exists and apartment with more than 3 students'
FROM student
GROUP BY dept_name
HAVING count(*) > 3

# Data Manipulation Language (DML) Operations 
Now let's learn about how to update tables by inserting, deleting, and updating rows.

## Inserting data
We first take a look at how to insert data into a table using SQL's `INSERT` command. Inserting a single new row is done as follows:
~~~sql
INSERT INTO table VALUES (value1, ..., valueN)
~~~

Insert a new department of Data Science

In [ ]:
%%sql
INSERT INTO department VALUES ('data science', 'Watson', 200000.0)

Now let's check the new state of table `department`

In [ ]:
%%sql
SELECT * FROM department

Now let's insert every instructor as a student. Since instructor and student `id`'s are overlapping we are using the last 4 digits of an instructor's id with a prefix  'I' as his/her student id

In [ ]:
%%sql
INSERT INTO student (
SELECT 'I' || substring(id,1,3) AS id, name, dept_name, 0 AS tot_cred
FROM instructor);

now let's look at our new student

In [ ]:
%%sql
SELECT * FROM student

... we made a mistake only using the first 3 digits of an id. Let's delete the new student to correct our error. Tow ways of achieving this are:

In [ ]:
%%sql
DELETE FROM student
WHERE substring(id,1,1) = 'I';

DELETE FROM student
WHERE id LIKE 'I%';

In [ ]:
%%sql
SELECT * FROM student

A better way may be to only insert instructors with ids that do not exist

In [ ]:
%%sql
INSERT INTO student 
(
SELECT i.id, name, dept_name, 0 AS tot_cred
FROM instructor i,
(SELECT id
FROM instructor
EXCEPT
SELECT id
FROM student) x
WHERE x.id = i.id)

A simpler way to express this query is (since we have already inserted these instructors this query now returns the empty set)

In [ ]:
%%sql
SELECT id, name, dept_name, 0 AS tot_cred
FROM instructor
WHERE id NOT IN (SELECT id FROM student)

Now let's give every student an extra 3 credits.

In [ ]:
%%sql
UPDATE student SET tot_cred = tot_cred + 3;

In [ ]:
%%sql
SELECT * FROM student

Now we want to delete the students with the highest credits in their departments. Let's start by writing a query that finds these students:

In [ ]:
%%sql
SELECT * FROM student s
WHERE tot_cred IN (SELECT max(m.tot_cred) FROM student m WHERE s.dept_name = m.dept_name)

Now we can delete the students

In [ ]:
%%sql
DELETE FROM student s
WHERE tot_cred IN (SELECT max(m.tot_cred) FROM student m WHERE s.dept_name = m.dept_name)

In [ ]:
%%sql
SELECT * FROM student

Alternatively, we could have written the nested subquery as (now returns which of the remaining students have the highest `tot_cred` values for their department)

In [ ]:
%%sql
SELECT * FROM student s
WHERE (tot_cred, dept_name) IN (SELECT max(m.tot_cred), dept_name FROM student m GROUP BY dept_name)

In [ ]:
%%sql
SELECT * FROM course

Set the credits of a course to `6` where the current credit value is `4`.

In [ ]:
%%sql
UPDATE course 
SET credits = 6
WHERE credits = 4

now let's check the new content of the course table

In [ ]:
%%sql
SELECT * FROM course;

Reduce the credits by `3` where the credits are currently larger equals to `6`.

In [ ]:
%%sql
UPDATE course 
SET credits = credits - 3
WHERE credits >= 6

In [ ]:
%%sql
SELECT * FROM course;

Set department to `Biology` and add `3` to the credits where the current credits are `3`.

In [ ]:
%%sql
UPDATE course 
SET credits = credits + 3, dept_name = 'Biology'
WHERE credits = 3

In [ ]:
%%sql
SELECT * FROM course;

or written using tuple constructors:

In [ ]:
%%sql
UPDATE course 
SET (credits, dept_name) = (credits + 3, 'Biology')
WHERE credits = 3

In [ ]:
%%sql
SELECT * FROM student

Example of conditional updates. Give CS students `10%` more credits and everybody else `5%` more

In [ ]:
%%sql
UPDATE student
SET tot_cred = 1.10 * tot_cred
WHERE dept_name = 'Comp. Sci.'

UPDATE student
SET tot_cred = 1.05 * tot_cred
WHERE dept_name <> 'Comp. Sci.'

This can be expressed using case to conditionally determine the new value. Here with one more case: `Biology` students get `15%` more credits.

In [ ]:
%%sql
UPDATE student
SET tot_cred = CASE 
                    WHEN dept_name = 'Comp. Sci.' THEN 1.10 * tot_cred 
                    WHEN dept_name = 'Biology' THEN 1.15 * tot_cred
                    ELSE 1.05 * tot_cred END